jbates35/stm32f4-drivers/src/stm32f446xx_i2c_interrupt.c
#include "stm32f446xx.h"
#include "stm32f446xx_i2c.h"

#define I2CS_NUM 3
#define I2CS {I2C1, I2C2, I2C3}
#define I2CS_RCC_REGS {&RCC->APB1ENR, &RCC->APB1ENR, &RCC->APB1ENR}
#define I2CS_RSTR_REGS {&RCC->APB1RSTR, &RCC->APB1RSTR, &RCC->APB1RSTR}
#define I2CS_RCC_POS {RCC_APB1ENR_I2C1EN_Pos, RCC_APB1ENR_I2C2EN_Pos, RCC_APB1ENR_I2C3EN_Pos}
#define SIZEOF(arr) ((int)sizeof(arr) / sizeof(arr[0]))
#define SIZEOFP(arr) ((int)sizeof(arr) / sizeof(uint32_t))  // Memory size of stm32f4

typedef enum { I2C_WRITE = 0, I2C_READ = 1 } I2CWriteOrRead_t;

typedef struct {
  void* buff;
  int32_t len;
  int32_t eles_left;
  I2CEnable_t en;
} I2CInterruptBuffer_t;

// Also used for DMA
typedef struct {
  I2CInterruptBuffer_t tx;
  I2CInterruptBuffer_t rx;
  I2CInterruptStatus_t status;
  uint8_t address;
  I2CInterruptCircular_t circular;
  DMA_Stream_TypeDef* tx_stream;
  DMA_Stream_TypeDef* rx_stream;
  void (*dma_start_transfer_cb)(DMA_Stream_TypeDef*, uint32_t);
  void (*callback)(void);
} I2CInterruptInfo_t;

static volatile I2CInterruptInfo_t i2c_interrupt_info[I2CS_NUM] = {0};

static inline int get_i2c_index(const I2C_TypeDef* addr) {
  const volatile I2C_TypeDef* i2c_addrs[] = I2CS;
  int i2c_index = -1;
  for (int i = 0; i < SIZEOFP(i2c_addrs); i++) {
    if (addr == i2c_addrs[i]) {
      i2c_index = i;
      break;
    }
  }
  return i2c_index;
}

static inline int is_i2c_instance(I2C_TypeDef* i2c_reg) {
  return (i2c_reg == I2C1 || i2c_reg == I2C2 || i2c_reg == I2C3);
}

static inline uint8_t get_status(const I2C_TypeDef* i2c_reg, const uint32_t mask) {
  if (i2c_reg->SR1 & mask) return 1;
  return 0;
}

static inline void clear_flag(I2C_TypeDef* i2c_reg, const uint32_t mask) { i2c_reg->SR1 &= ~mask; }

volatile static inline I2CInterruptInfo_t* get_i2c_int_info(const I2C_TypeDef* i2c_reg) {
  if (i2c_reg == I2C1)
    return &i2c_interrupt_info[0];
  else if (i2c_reg == I2C2)
    return &i2c_interrupt_info[1];
  else if (i2c_reg == I2C3)
    return &i2c_interrupt_info[2];
  return NULL;
}

static inline void clear_i2c_info(volatile I2CInterruptInfo_t* int_info) {
  int_info->tx.buff = 0;
  int_info->tx.len = 0;
  int_info->tx.eles_left = 0;
  int_info->tx.en = I2C_DISABLE;
  int_info->rx.buff = 0;
  int_info->rx.len = 0;
  int_info->rx.eles_left = 0;
  int_info->rx.en = I2C_DISABLE;
  int_info->status = I2C_INTERRUPT_STATUS_READY;
  int_info->address = 0;
  int_info->callback = 0;
  int_info->circular = 0;
}

/**
 * @brief Sets up the interrupt configuration for an I2C peripheral.
 *
 * Initializes the interrupt info structure for the given I2C peripheral with the provided
 * transmit and receive buffer information, address, circular mode, and callback.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @param setup_info Pointer to the I2CInterruptConfig_t structure containing setup parameters.
 * @return I2CStatus_t Status of the setup operation.
 */
I2CStatus_t i2c_setup_interrupt(I2C_TypeDef* i2c_reg, const I2CInterruptConfig_t* setup_info) {
  volatile I2CInterruptInfo_t* int_info = get_i2c_int_info(i2c_reg);
  if (int_info == NULL) return I2C_STATUS_I2C_ADDR_INVALID;

  // Maybe have a look at this line ...
  if (int_info->status == I2C_INTERRUPT_STATUS_BUSY) return I2C_STATUS_INTERRUPT_BUSY;

  // Clear anything in that int_info buff
  clear_i2c_info(int_info);

  // TX specific buffer
  int_info->tx.buff = setup_info->tx.buff;
  int_info->tx.len = setup_info->tx.len;
  int_info->tx.eles_left = setup_info->tx.len;

  // Enable if tx stuff has buffer was assigned and length isn't 0
  int_info->tx.en = (int_info->tx.buff != NULL && int_info->tx.len) ? I2C_ENABLE : I2C_DISABLE;

  // RX specific buffer
  int_info->rx.buff = setup_info->rx.buff;
  int_info->rx.len = setup_info->rx.len;
  int_info->rx.eles_left = setup_info->rx.len;

  // Enable if rx stuff has buffer was assigned and length isn't 0
  int_info->rx.en = (int_info->rx.buff != NULL && int_info->rx.len) ? I2C_ENABLE : I2C_DISABLE;

  // General interrupt stuff
  int_info->address = setup_info->address;
  int_info->circular = setup_info->circular;
  int_info->callback = setup_info->callback;

  return I2C_STATUS_OK;
}
// Enable if rx stuff has buffer was assigned and length isn't 0

/**
 * @brief Determines the current I2C event interrupt type.
 *
 * Checks the I2C status registers to identify the current event (start, address sent, RXNE, TXE, BTF).
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @return I2CIRQType_t The identified IRQ event type.
 */
I2CIRQType_t i2c_irq_event_handling(const I2C_TypeDef* i2c_reg) {
  if (get_status(i2c_reg, I2C_SR1_SB)) return I2C_IRQ_TYPE_STARTED;
  if (get_status(i2c_reg, I2C_SR1_ADDR)) return I2C_IRQ_TYPE_ADDR_SENT;
  if (get_status(i2c_reg, I2C_SR1_RXNE)) return I2C_IRQ_TYPE_RXNE;
  if (get_status(i2c_reg, I2C_SR1_TXE)) return I2C_IRQ_TYPE_TXE;
  if (get_status(i2c_reg, I2C_SR1_BTF)) return I2C_IRQ_TYPE_BTF;

  return I2C_IRQ_TYPE_NONE;
}

/**
 * @brief Handles I2C error interrupts and clears error flags.
 *
 * Checks for arbitration lost, bus error, acknowledge failure, timeout, and overrun errors.
 * Clears the corresponding error flag and returns the error type.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @return I2CIRQType_t The identified IRQ error type, or NONE if no error.
 */
I2CIRQType_t i2c_irq_error_handling(I2C_TypeDef* i2c_reg) {
  if (get_status(i2c_reg, I2C_SR1_ARLO)) {
    clear_flag(i2c_reg, I2C_SR1_ARLO);
    return I2C_IRQ_TYPE_ERROR_ARBLOST;
  }

  if (get_status(i2c_reg, I2C_SR1_BERR)) {
    clear_flag(i2c_reg, I2C_SR1_BERR);
    return I2C_IRQ_TYPE_ERROR_BUS;
  }

  if (get_status(i2c_reg, I2C_SR1_AF)) {
    clear_flag(i2c_reg, I2C_SR1_AF);
    return I2C_IRQ_TYPE_ERROR_ACKFAIL;
  }

  if (get_status(i2c_reg, I2C_SR1_TIMEOUT)) {
    clear_flag(i2c_reg, I2C_SR1_TIMEOUT);
    return I2C_IRQ_TYPE_ERROR_TIMEOUT;
  }

  if (get_status(i2c_reg, I2C_SR1_OVR)) {
    clear_flag(i2c_reg, I2C_SR1_OVR);
    return I2C_IRQ_TYPE_ERROR_OVERRUN;
  }

  return I2C_IRQ_TYPE_NONE;
}

/**
 * @brief Starts an I2C interrupt-driven transaction.
 *
 * Sets the interrupt info status to busy and generates a START condition.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @return I2CStatus_t Status of the start operation.
 */
I2CStatus_t i2c_start_interrupt(I2C_TypeDef* i2c_reg) {
  volatile I2CInterruptInfo_t* int_info = get_i2c_int_info(i2c_reg);
  if (int_info == NULL) return I2C_STATUS_I2C_ADDR_INVALID;

  // Start transaction, change struct to busy so user knows they shouldn't touch CRs and what not
  int_info->status = I2C_INTERRUPT_STATUS_BUSY;
  i2c_reg->CR1 |= I2C_CR1_START;

  return I2C_STATUS_OK;
}

typedef enum { I2C_INT_TSTATUS_OK = 0, I2C_INT_TSTATUS_INVALID_TRANSACTION } I2CIntTransferStatus_t;

static inline void send_addr(I2C_TypeDef* i2c_reg, uint8_t addr, uint8_t lsb) { i2c_reg->DR = ((addr << 1) | lsb); }

static inline void init_xmission(I2C_TypeDef* i2c_reg, uint8_t rx) {
  // If rx, it needs acks sent
  if (rx) i2c_reg->CR1 |= I2C_CR1_ACK;

  // Enable data IRQs
  i2c_reg->CR2 |= I2C_CR2_ITBUFEN;

  // Clear SR regs
  (void)i2c_reg->SR1;
  (void)i2c_reg->SR2;
}

static inline void init_xmission_dma(I2C_TypeDef* i2c_reg, volatile I2CInterruptInfo_t* int_info, uint8_t rx) {
  // If rx, it needs acks sent
  if (rx && int_info->rx.len > 1) i2c_reg->CR1 |= I2C_CR1_ACK;

  // START DMA HERE
  i2c_reg->CR2 |= I2C_CR2_DMAEN;

  // Clear SR regs
  (void)i2c_reg->SR1;
  (void)i2c_reg->SR2;

  if (rx) {
    i2c_reg->CR2 |= I2C_CR2_LAST;
    int_info->dma_start_transfer_cb(int_info->rx_stream, int_info->rx.len);
  } else {
    i2c_reg->CR2 &= ~I2C_CR2_LAST;
    int_info->dma_start_transfer_cb(int_info->tx_stream, int_info->tx.len);
  }
}

static inline I2CIntTransferStatus_t send_data(I2C_TypeDef* i2c_reg, volatile I2CInterruptBuffer_t* tx_buff) {
  // Return if no elements left or if for some reason len is below eles_left
  uint8_t invalid_eles = (tx_buff->eles_left > tx_buff->len);
  uint8_t no_eles_left = (tx_buff->eles_left <= 0);
  if (invalid_eles || no_eles_left) return I2C_INT_TSTATUS_INVALID_TRANSACTION;

  // Load byte from buff into DR register
  int i = tx_buff->len - tx_buff->eles_left;
  i2c_reg->DR = ((uint8_t*)tx_buff->buff)[i];
  tx_buff->eles_left--;

  return I2C_INT_TSTATUS_OK;
}

static inline I2CIntTransferStatus_t end_send_data(I2C_TypeDef* i2c_reg, volatile I2CInterruptInfo_t* int_info) {
  // After TXE, need to make sure shift register is also cleared
  if (!(i2c_reg->SR1 & I2C_SR1_BTF)) return I2C_INT_TSTATUS_OK;

  // Disable data from triggering isr
  i2c_reg->CR2 &= ~I2C_CR2_ITBUFEN;

  uint8_t rx_enabled = (int_info->rx.en == I2C_ENABLE);
  uint8_t rx_has_eles = (int_info->rx.eles_left > 0);
  if (rx_enabled && rx_has_eles)
    // If rx is locked and loaded, we need a repeated start
    i2c_reg->CR1 |= I2C_CR1_START;
  else
    // If rx is weak and disabled, we need a stop bit sent
    i2c_reg->CR1 |= I2C_CR1_STOP;

  int_info->tx.en = I2C_DISABLE;

  return I2C_INT_TSTATUS_OK;
}

static inline void end_send_data_dma(I2C_TypeDef* i2c_reg, I2CTxRxDirection_t dir, uint8_t repeated_start) {
  // After TXE, need to make sure shift register is also cleared
  i2c_reg->CR2 &= ~(I2C_CR2_DMAEN);

  if (dir == I2C_TXRX_DIR_RECEIVE) {
    i2c_reg->CR1 &= ~I2C_CR1_ACK;
  } else {
    while (!(i2c_reg->SR1 & I2C_SR1_BTF));
  }

  if (!repeated_start) i2c_reg->CR1 |= I2C_CR1_STOP;
}

static inline I2CIntTransferStatus_t single_byte_setup(I2C_TypeDef* i2c_reg, volatile I2CInterruptBuffer_t* rx_buff) {
  // Return if no elements left or if for some reason len is below eles_left
  // Also make sure it's actually a single byte transfer
  uint8_t invalid_eles = (rx_buff->eles_left > rx_buff->len);
  uint8_t no_eles_left = (rx_buff->eles_left <= 0);
  uint8_t len_isnt_1 = (rx_buff->len != 1);
  if (invalid_eles || no_eles_left || len_isnt_1) return I2C_INT_TSTATUS_INVALID_TRANSACTION;

  // Set ack low and set stop bit high
  i2c_reg->CR1 &= ~(1 << I2C_CR1_ACK_Pos);
  i2c_reg->CR1 |= (1 << I2C_CR1_STOP_Pos);

  // Clear all flags from SR regs
  (void)i2c_reg->SR1;
  (void)i2c_reg->SR2;

  return I2C_INT_TSTATUS_OK;
}

static inline I2CIntTransferStatus_t receive_data(I2C_TypeDef* i2c_reg, volatile I2CInterruptBuffer_t* rx_buff) {
  // Make sure it's actually a single byte transfer
  uint8_t invalid_eles = (rx_buff->eles_left > rx_buff->len);
  uint8_t no_eles_left = (rx_buff->eles_left <= 0);
  if (invalid_eles || no_eles_left) return I2C_INT_TSTATUS_INVALID_TRANSACTION;

  // STM32 I2C implementation requires this procedure when 2 bytes left
  // Refer to manual
  if (rx_buff->eles_left == 2) {
    i2c_reg->CR1 &= ~(1 << I2C_CR1_ACK_Pos);
    i2c_reg->CR1 |= (1 << I2C_CR1_STOP_Pos);
  }

  // Load byte from DR into given buffer
  int i = rx_buff->len - rx_buff->eles_left;
  ((uint8_t*)rx_buff->buff)[i] = (uint8_t)i2c_reg->DR;
  rx_buff->eles_left--;

  // Disable data IRQ and disable RX buffer when transfer done
  if (!rx_buff->eles_left) {
    i2c_reg->CR2 &= ~I2C_CR2_ITBUFEN;
    rx_buff->en = I2C_DISABLE;
  }

  return I2C_INT_TSTATUS_OK;
}

/**
 * @brief Handles I2C word-level interrupt events for transmit and receive.
 *
 * Processes TX and RX events based on the current IRQ reason, manages buffer state,
 * and invokes the callback when the transaction is complete or circular mode is enabled.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @return I2CInterruptStatus_t The current status of the interrupt transaction.
 */
I2CInterruptStatus_t i2c_irq_word_handling(I2C_TypeDef* i2c_reg) {
  I2CIRQType_t irq_reason = i2c_irq_event_handling(i2c_reg);
  volatile I2CInterruptInfo_t* int_info = get_i2c_int_info(i2c_reg);

  I2CIntTransferStatus_t tstatus = I2C_INT_TSTATUS_OK;

  if (int_info->tx.en) {
    // TX:
    if (irq_reason == I2C_IRQ_TYPE_STARTED) {
      send_addr(i2c_reg, 0x68, 0);
    } else if (irq_reason == I2C_IRQ_TYPE_ADDR_SENT) {
      init_xmission(i2c_reg, 0);
    } else if (irq_reason == I2C_IRQ_TYPE_TXE && int_info->tx.eles_left) {
      tstatus = send_data(i2c_reg, &int_info->tx);
    } else if (irq_reason == I2C_IRQ_TYPE_TXE) {
      tstatus = end_send_data(i2c_reg, int_info);
    }
  } else if (int_info->rx.en) {
    // RX:
    if (irq_reason == I2C_IRQ_TYPE_STARTED) {
      send_addr(i2c_reg, 0x68, 1);
    } else if (irq_reason == I2C_IRQ_TYPE_ADDR_SENT) {
      init_xmission(i2c_reg, 1);
      // Special method required to set up if length of transfer is just 1
      if (int_info->rx.len == 1) tstatus = single_byte_setup(i2c_reg, &int_info->rx);
    } else if (irq_reason == I2C_IRQ_TYPE_RXNE && int_info->rx.eles_left) {
      tstatus = receive_data(i2c_reg, &int_info->rx);
    }
  }
  // If there was a problem, set to error and return as such
  if (tstatus != I2C_INT_TSTATUS_OK) {
    int_info->status = I2C_INTERRUPT_STATUS_ERROR;
    return int_info->status;
  }

  // If both tx and rx are done, we need to cleanup logic, set callback, and load buffer again if set to circular
  uint8_t tx_done = !int_info->tx.en || !int_info->tx.eles_left;
  uint8_t rx_done = !int_info->rx.en || !int_info->rx.eles_left;

  // Check for this to ensure following logic is done only once
  uint8_t int_busy = (int_info->status == I2C_INTERRUPT_STATUS_BUSY);

  if (tx_done && rx_done && int_busy) {
    int_info->status = I2C_INTERRUPT_STATUS_DONE;

    if (int_info->callback) int_info->callback();

    // Re-setup and re-enable interrupt if circular
    if (int_info->circular == I2C_INTERRUPT_CIRCULAR) {
      // Restart interrupt
      i2c_reset_interrupt(i2c_reg);
      i2c_start_interrupt(i2c_reg);
    }
  }

  return int_info->status;
}

/**
 * @brief Resets the interrupt info structure for the specified I2C peripheral.
 *
 * Resets the TX and RX buffer state and sets the interrupt status to ready.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @return I2CStatus_t Status of the reset operation.
 */
I2CStatus_t i2c_reset_interrupt(const I2C_TypeDef* i2c_reg) {
  volatile I2CInterruptInfo_t* int_info = get_i2c_int_info(i2c_reg);
  if (int_info == NULL) return I2C_STATUS_I2C_ADDR_INVALID;

  // TX specific buffer
  int_info->tx.eles_left = int_info->tx.len;
  int_info->tx.en = I2C_ENABLE;

  // RX specific buffer
  int_info->rx.eles_left = int_info->rx.len;
  int_info->rx.en = I2C_ENABLE;

  int_info->status = I2C_INTERRUPT_STATUS_READY;

  return I2C_STATUS_OK;
}

/**
 * @brief Starts an I2C DMA interrupt-driven transaction.
 *
 * Sets the interrupt info status to busy and generates a START condition for DMA-based transfers.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @return I2CStatus_t Status of the start operation.
 */
I2CStatus_t i2c_start_interrupt_dma(I2C_TypeDef* i2c_reg) {
  volatile I2CInterruptInfo_t* int_info = get_i2c_int_info(i2c_reg);
  if (int_info == NULL) return I2C_STATUS_I2C_ADDR_INVALID;

  // Start transaction, change struct to busy so user knows they shouldn't touch CRs and what not
  int_info->status = I2C_INTERRUPT_STATUS_BUSY;
  i2c_reg->CR1 |= I2C_CR1_START;

  return I2C_STATUS_OK;
}

/**
 * @brief Sets up the DMA interrupt configuration for an I2C peripheral.
 *
 * Initializes the interrupt info structure for the given I2C peripheral with the provided
 * DMA transmit and receive buffer information, circular mode, callback, and DMA streams.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @param setup_info Pointer to the I2CDMAConfig_t structure containing DMA setup parameters.
 * @return I2CStatus_t Status of the setup operation.
 */
I2CStatus_t i2c_setup_interrupt_dma(const I2C_TypeDef* i2c_reg, const I2CDMAConfig_t* setup_info) {
  volatile I2CInterruptInfo_t* int_info = get_i2c_int_info(i2c_reg);
  if (int_info == NULL) return I2C_STATUS_I2C_ADDR_INVALID;

  // Clear anything in that int_info buff
  clear_i2c_info(int_info);

  // TX specific buffer
  int_info->tx.buff = setup_info->tx.buff;
  int_info->tx.len = setup_info->tx.len;

  // Enable if tx stuff has buffer was assigned and length isn't 0
  int_info->tx.en = (int_info->tx.buff && int_info->tx.len) ? I2C_ENABLE : I2C_DISABLE;
  if (int_info->tx.en) setup_info->dma_set_buffer_cb(setup_info->tx_stream, int_info->tx.buff);

  // RX specific buffer
  int_info->rx.buff = setup_info->rx.buff;
  int_info->rx.len = setup_info->rx.len;

  // Enable if rx stuff has buffer was assigned and length isn't 0
  int_info->rx.en = (int_info->rx.buff && int_info->rx.len) ? I2C_ENABLE : I2C_DISABLE;
  if (int_info->rx.en) setup_info->dma_set_buffer_cb(setup_info->rx_stream, int_info->rx.buff);

  // General interrupt stuff
  int_info->circular = setup_info->circular;
  int_info->callback = setup_info->callback;

  // DMA specific stuf
  int_info->tx_stream = setup_info->tx_stream;
  int_info->rx_stream = setup_info->rx_stream;
  int_info->dma_start_transfer_cb = setup_info->dma_start_transfer_cb;

  return I2C_STATUS_OK;
}

/**
 * @brief Handles the start phase of an I2C DMA interrupt transaction.
 *
 * Sends the slave address and initializes DMA transfer for TX or RX, depending on the buffer state.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @return I2CInterruptStatus_t The current status of the interrupt transaction.
 */
I2CInterruptStatus_t i2c_dma_irq_handling_start(I2C_TypeDef* i2c_reg) {
  if (!is_i2c_instance(i2c_reg)) return I2C_INTERRUPT_STATUS_INVALID_ADDR;

  I2CIRQType_t irq_reason = i2c_irq_event_handling(i2c_reg);
  volatile I2CInterruptInfo_t* int_info = get_i2c_int_info(i2c_reg);

  I2CIntTransferStatus_t tstatus = I2C_INT_TSTATUS_OK;

  if (int_info->tx.en) {
    // TX logic - send address, start dma ...
    if (irq_reason == I2C_IRQ_TYPE_STARTED) {
      send_addr(i2c_reg, 0x68, 0);
    } else if (irq_reason == I2C_IRQ_TYPE_ADDR_SENT) {
      init_xmission_dma(i2c_reg, int_info, 0);
    }
  } else if (int_info->rx.en) {
    // RX logic - send address, start dma ...
    if (irq_reason == I2C_IRQ_TYPE_STARTED) {
      send_addr(i2c_reg, 0x68, 1);
    } else if (irq_reason == I2C_IRQ_TYPE_ADDR_SENT) {
      init_xmission_dma(i2c_reg, int_info, 1);
    }
  }

  // If there was a problem, set to error and return as such
  if (tstatus != I2C_INT_TSTATUS_OK) int_info->status = I2C_INTERRUPT_STATUS_ERROR;
  return int_info->status;
}

/**
 * @brief Handles the end phase of an I2C DMA interrupt transaction.
 *
 * Finalizes the DMA transfer for TX or RX, manages repeated start if needed, and invokes the callback
 * when the transaction is complete or circular mode is enabled.
 *
 * @param i2c_reg Pointer to the I2C peripheral base address.
 * @param dir Direction of the transfer (I2C_TXRX_DIR_SEND or I2C_TXRX_DIR_RECEIVE).
 * @return I2CInterruptStatus_t The current status of the interrupt transaction.
 */
I2CInterruptStatus_t i2c_dma_irq_handling_end(I2C_TypeDef* i2c_reg, I2CTxRxDirection_t dir) {
  if (!is_i2c_instance(i2c_reg)) return I2C_INTERRUPT_STATUS_INVALID_ADDR;

  I2CIRQType_t irq_reason = i2c_irq_event_handling(i2c_reg);
  volatile I2CInterruptInfo_t* int_info = get_i2c_int_info(i2c_reg);

  // If TX, see if RX is there so we repeat start
  if (dir == I2C_TXRX_DIR_SEND) {
    uint8_t repeated_start = int_info->rx.en ? 1 : 0;
    end_send_data_dma(i2c_reg, dir, repeated_start);
    int_info->tx.en = I2C_DISABLE;
    if (repeated_start) i2c_start_interrupt_dma(i2c_reg);
  }

  // If RX, at end of sequence
  if (dir == I2C_TXRX_DIR_RECEIVE) {
    end_send_data_dma(i2c_reg, dir, 0);
    int_info->rx.en = I2C_DISABLE;
  }

  uint8_t tx_en = (int_info->tx.en == I2C_ENABLE);
  uint8_t rx_en = (int_info->rx.en == I2C_ENABLE);

  // Cleanup after tx/rx is done
  if (!tx_en && !rx_en) {
    int_info->status = I2C_INTERRUPT_STATUS_DONE;
    if (int_info->callback) int_info->callback();

    // Re-enable the tx and rx if need be - get ready for re-trigger
    if (int_info->tx.buff && int_info->tx.len) int_info->tx.en = I2C_ENABLE;
    if (int_info->rx.buff && int_info->rx.len) int_info->rx.en = I2C_ENABLE;

    // If circular, we can go ahead and start the next transaction
    if (int_info->circular == I2C_INTERRUPT_CIRCULAR) {
      i2c_start_interrupt_dma(i2c_reg);
    }
  }
  return int_info->status;
}
